title: Add file from suspicious location to autostart registry
status: experimental
description: Add file from suspicious location to autostart registry
author: Joe Security
date: 2020-03-19
id: 200067
threatname:
behaviorgroup: 2
classification: 4
mitreattack:

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '*reg add *\windows\currentversion\run /f /v *\appdata\roaming*'
            - '*reg add *\windows\currentversion\run /v *\appdata\local*'
            - '*reg add *\software\microsoft\windows nt\currentversion\windows*/v load*appdata\roaming*'
    condition: selection
level: critical
