title: Execute Script with spoofed extension
status: experimental
description: Execute Script with spoofed extension
author: Joe Security
date: 2020-12-04
id: 200092
threatname:
behaviorgroup: 1
classification: 8
mitreattack:

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '*/e:jscript*\\*.txt*'
            - '*/e:jscript*\\*.pdf*'
            - '*/e:jscript*\\*.htm*'
            - '*/e:jscript*\\*.png*'
            - '*/e:jscript*\\*.jpeg*'
            - '*/e:jscript*\\*.jpg*'              
    condition: selection
level: critical
