title: FileDroppedByEQNEDT32EXE
status: experimental
description: File dropped by EQNEDT32.EXE(CVE-2017-11882)
author: Joe Security
date: 2019-10-29
id: 200013
threatname:
behaviorgroup: 25
classification: 7
logsource:
      service: sysmon
      product: windows
detection:
    selection:
        EventID: 11
        Image: '*\EQUATION\EQNEDT32.EXE*'
        TargetFilename:
			- '*\\*.exe*'
			- '*\\*.dll*'
			- '*\\*.vbs*'
			- '*\\*.js*'
			- '*\\*.hta*'
			- '*\\*.bat*'
    condition: selection
level: critical
