title: MSBuild connects to smtp port
status: experimental
description: MSBuild connects to smtp port 
author: Joe Security
date: 2019-11-19
id: 200029
threatname:
behaviorgroup: 12
classification: 1
mitreattack: 

logsource:
    service: sysmon
    product: windows
detection:
    selection:
        EventID: 3
        DestinationPort: '587'
        Image: '*\Microsoft.NET\\*MSBuild.exe*'
    condition: selection
level: critical
