title: MSBuildLaunchedByScr
status: experimental
description: Code injection in msbuild.exe by .scr file
author: Joe Security
date: 2019-10-21
id: 200005
threatname:
behaviorgroup: 4
classification: 4
mitreattack: T1127

logsource:
      category: process_creation
      product: windows
detection:
      selection:      
          ParentCommandLine: '*\\*.scr*'
          CommandLine:
              -'*\Microsoft.NET\\*\MSBuild.exe*'
      condition: selection
level: critical
