title: NanoCore
status: experimental
description: detect run.dat of NanoCore
author: Joe Security
date: 2019-11-08
id: 200023
threatname: NanoCore
behaviorgroup: 14,20,21,22
classification: 4
logsource:
      service: sysmon
      product: windows
detection:
    selection:
        EventID: 11
        TargetFilename: '*\AppData\Roaming\\*-*-*-*-*\run.dat*'
    condition: selection
level: critical
