title: ONENOTE drops suspicious file
status: experimental
description: ONENOTE drops suspicious file
author: Joe Security
date: 2023-01-11
id: 200109
threatname:
behaviorgroup: 1
classification: 7
logsource:
    service: sysmon
    product: windows
detection:
    selection:
        EventID: 11
        Image:
            - '*\microsoft office\root\office*\onenote.exe'
            - '*\microsoft office\office*\onenote.exe'
        TargetFilename:
            - '*\exported*\\*.hta'
            - '*\exported*\\*.lnk'
            - '*\exported*\\*.vbs'
            - '*\exported*\\*.js'
            - '*\exported*\\*.bat'
            - '*\onenoteofflinecache_files\\*.hta'            
            - '*\onenoteofflinecache_files\\*.vbs'
            - '*\onenoteofflinecache_files\\*.js'
            - '*\onenoteofflinecache_files\\*.bat'
            
    condition: selection
level: critical
