title: Powershell Decrypt And Execute Base64 Data
status: experimental
description: powershell decrypts and execute hardcoded base64 blob 
author: Joe Security
date: 2019-10-22
id: 200006
threatname:
behaviorgroup: 1
classification: 8
mitreattack:

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '*\powershell.exe* $* = [string][System.Text.Encoding]::ASCII.GetString([System.Convert]::FromBase64String(*;iex $*'
            - '*FromBase64String(*;IEX (*'
            - '*frombase64string(*start-process $*'
            - '*iex ([system.text.encoding]::ascii.getstring([system.convert]::frombase64string(*'
            - '*invoke-expression $(new-object io.streamreader ($(new-object io.compression.deflatestream ($(new-object io.memorystream (,$([convert]::frombase64string(*'
            - '*:frombase64string(*iex $*'
            - '*.processstartinfo*::frombase64string*'
    condition: selection
level: critical
