title: PowershellLaunchedByWinword
status: experimental
description: powershell with enco parameter launched by winword / excel / powerpoint
author: Joe Security
date: 2019-10-18
id: 200002
threatname:
behaviorgroup: 1
classification: 5
mitreattack: T1055
matchonlyifnot: 184

logsource:
      category: process_creation
      product: windows
detection:
      selection:      
          ParentImage: '*\Program Files\Microsoft Office*.EXE'
          CommandLine:
              -'*\powershell.exe* -enco *'
      condition: selection
level: critical
