title: Powershell download payload from hardcoded c2 list
status: experimental
description: Powershell download payload from hardcoded c2 list
author: Joe Security
date: 2020-02-18
id: 200056
threatname:
behaviorgroup: 10
classification: 1
mitreattack:

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '*powershell*Foreach*(*http*http*'
    condition: selection
level: critical
