title: Scheduled temp file as task from temp location
status: experimental
description: Scheduled temp file as task from temp location
author: Joe Security
date: 2019-12-20
id: 200038
threatname:
behaviorgroup: 2
classification: 4
mitreattack:

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '*schtasks*/create*/xml*\temp\\*.tmp*'
    condition: selection
level: critical
