title: Wake-On-Lan
status: experimental
description: Sending magic Wake-On-Lan packet on port 7
author: Joe Security
date: 2020-01-14
id: 200042
threatname:
behaviorgroup: 12
classification: 1
mitreattack: 

logsource:
    service: sysmon
    product: windows
detection:
    selection:
        EventID: 3
        DestinationPort: '7'
    condition: selection
level: critical
