title: Winword Drops Script In Startup
status: experimental
description: Winword.exe drops script file in startup location
author: Joe Security
id: 200017
threatname:
behaviorgroup: 1
classification: 7
logsource:
    service: sysmon
    product: windows
detection:
    selection:
        EventID: 11
        Image: '*\Microsoft Office\Office*\WINWORD.EXE*'
        TargetFilename:
            - '*\AppData\Roaming\Microsoft\\*\STARTUP\\*.vbs*'
            - '*\AppData\Roaming\Microsoft\\*\STARTUP\\*.js*'
            - '*\AppData\Roaming\Microsoft\\*\STARTUP\\*.bat*'
            - '*\AppData\Roaming\Microsoft\\*\STARTUP\\*.url*'
            - '*\AppData\Roaming\Microsoft\\*\STARTUP\\*.cmd*'
            - '*\AppData\Roaming\Microsoft\\*\STARTUP\\*.hta*'
            - '*\AppData\Roaming\Microsoft\\*\STARTUP\\*.ps1*'
    condition: selection
level: critical
