title: Wmic Launch regsvr32
status: experimental
description: Wmic launch regsvr32
author: Joe Security
date: 2020-01-30
id: 200045
threatname:
behaviorgroup: 10
classification: 1
mitreattack:

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine:
            - '*wmic*process call create *regsvr32*'
    condition: selection
level: critical
